docs/baseline/perf_after_indexes_k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/federation.js
        output: -

     scenarios: (100.00%) 3 scenarios, 20 max VUs, 2m10s max duration (incl. graceful stop):
              * memberships_listing: 10 looping VUs for 30s (exec: membershipsListing, gracefulStop: 30s)
              * applications_index: 10 looping VUs for 30s (exec: applicationsIndex, startTime: 35s, gracefulStop: 30s)
              * identity_me: 10 looping VUs for 30s (exec: identityMe, startTime: 1m10s, gracefulStop: 30s)


running (0m01.0s), 10/20 VUs, 10 complete and 0 interrupted iterations
memberships_listing   [   3% ] 10 VUs   01.0s/30s
applications_index  • [   0% ] waiting  34.0s
identity_me         • [   0% ] waiting  1m09.0s

running (0m02.0s), 10/20 VUs, 29 complete and 0 interrupted iterations
memberships_listing   [   7% ] 10 VUs   02.0s/30s
applications_index  • [   0% ] waiting  33.0s
identity_me         • [   0% ] waiting  1m08.0s

running (0m03.0s), 10/20 VUs, 49 complete and 0 interrupted iterations
memberships_listing   [  10% ] 10 VUs   03.0s/30s
applications_index  • [   0% ] waiting  32.0s
identity_me         • [   0% ] waiting  1m07.0s

running (0m04.0s), 10/20 VUs, 60 complete and 0 interrupted iterations
memberships_listing   [  13% ] 10 VUs   04.0s/30s
applications_index  • [   0% ] waiting  31.0s
identity_me         • [   0% ] waiting  1m06.0s

running (0m05.0s), 10/20 VUs, 79 complete and 0 interrupted iterations
memberships_listing   [  17% ] 10 VUs   05.0s/30s
applications_index  • [   0% ] waiting  30.0s
identity_me         • [   0% ] waiting  1m05.0s

running (0m06.0s), 10/20 VUs, 99 complete and 0 interrupted iterations
memberships_listing   [  20% ] 10 VUs   06.0s/30s
applications_index  • [   0% ] waiting  29.0s
identity_me         • [   0% ] waiting  1m04.0s

running (0m07.0s), 10/20 VUs, 110 complete and 0 interrupted iterations
memberships_listing   [  23% ] 10 VUs   07.0s/30s
applications_index  • [   0% ] waiting  28.0s
identity_me         • [   0% ] waiting  1m03.0s

running (0m08.0s), 10/20 VUs, 130 complete and 0 interrupted iterations
memberships_listing   [  27% ] 10 VUs   08.0s/30s
applications_index  • [   0% ] waiting  27.0s
identity_me         • [   0% ] waiting  1m02.0s

running (0m09.0s), 10/20 VUs, 149 complete and 0 interrupted iterations
memberships_listing   [  30% ] 10 VUs   09.0s/30s
applications_index  • [   0% ] waiting  26.0s
identity_me         • [   0% ] waiting  1m01.0s

running (0m10.0s), 10/20 VUs, 168 complete and 0 interrupted iterations
memberships_listing   [  33% ] 10 VUs   10.0s/30s
applications_index  • [   0% ] waiting  25.0s
identity_me         • [   0% ] waiting  1m00.0s

running (0m11.0s), 10/20 VUs, 187 complete and 0 interrupted iterations
memberships_listing   [  37% ] 10 VUs   11.0s/30s
applications_index  • [   0% ] waiting  24.0s
identity_me         • [   0% ] waiting  0m59.0s

running (0m12.0s), 10/20 VUs, 206 complete and 0 interrupted iterations
memberships_listing   [  40% ] 10 VUs   12.0s/30s
applications_index  • [   0% ] waiting  23.0s
identity_me         • [   0% ] waiting  0m58.0s

running (0m13.0s), 10/20 VUs, 221 complete and 0 interrupted iterations
memberships_listing   [  43% ] 10 VUs   13.0s/30s
applications_index  • [   0% ] waiting  22.0s
identity_me         • [   0% ] waiting  0m57.0s

running (0m14.0s), 10/20 VUs, 241 complete and 0 interrupted iterations
memberships_listing   [  47% ] 10 VUs   14.0s/30s
applications_index  • [   0% ] waiting  21.0s
identity_me         • [   0% ] waiting  0m56.0s

running (0m15.0s), 10/20 VUs, 261 complete and 0 interrupted iterations
memberships_listing   [  50% ] 10 VUs   15.0s/30s
applications_index  • [   0% ] waiting  20.0s
identity_me         • [   0% ] waiting  0m55.0s

running (0m16.0s), 10/20 VUs, 278 complete and 0 interrupted iterations
memberships_listing   [  53% ] 10 VUs   16.0s/30s
applications_index  • [   0% ] waiting  19.0s
identity_me         • [   0% ] waiting  0m54.0s

running (0m17.0s), 10/20 VUs, 297 complete and 0 interrupted iterations
memberships_listing   [  57% ] 10 VUs   17.0s/30s
applications_index  • [   0% ] waiting  18.0s
identity_me         • [   0% ] waiting  0m53.0s

running (0m18.0s), 10/20 VUs, 316 complete and 0 interrupted iterations
memberships_listing   [  60% ] 10 VUs   18.0s/30s
applications_index  • [   0% ] waiting  17.0s
identity_me         • [   0% ] waiting  0m52.0s

running (0m19.0s), 10/20 VUs, 335 complete and 0 interrupted iterations
memberships_listing   [  63% ] 10 VUs   19.0s/30s
applications_index  • [   0% ] waiting  16.0s
identity_me         • [   0% ] waiting  0m51.0s

running (0m20.0s), 10/20 VUs, 349 complete and 0 interrupted iterations
memberships_listing   [  67% ] 10 VUs   20.0s/30s
applications_index  • [   0% ] waiting  15.0s
identity_me         • [   0% ] waiting  0m50.0s

running (0m21.0s), 10/20 VUs, 368 complete and 0 interrupted iterations
memberships_listing   [  70% ] 10 VUs   21.0s/30s
applications_index  • [   0% ] waiting  14.0s
identity_me         • [   0% ] waiting  0m49.0s

running (0m22.0s), 10/20 VUs, 390 complete and 0 interrupted iterations
memberships_listing   [  73% ] 10 VUs   22.0s/30s
applications_index  • [   0% ] waiting  13.0s
identity_me         • [   0% ] waiting  0m48.0s

running (0m23.0s), 10/20 VUs, 409 complete and 0 interrupted iterations
memberships_listing   [  77% ] 10 VUs   23.0s/30s
applications_index  • [   0% ] waiting  12.0s
identity_me         • [   0% ] waiting  0m47.0s

running (0m24.0s), 10/20 VUs, 428 complete and 0 interrupted iterations
memberships_listing   [  80% ] 10 VUs   24.0s/30s
applications_index  • [   0% ] waiting  11.0s
identity_me         • [   0% ] waiting  0m46.0s

running (0m25.0s), 10/20 VUs, 443 complete and 0 interrupted iterations
memberships_listing   [  83% ] 10 VUs   25.0s/30s
applications_index  • [   0% ] waiting  10.0s
identity_me         • [   0% ] waiting  0m45.0s

running (0m26.0s), 10/20 VUs, 462 complete and 0 interrupted iterations
memberships_listing   [  87% ] 10 VUs   26.0s/30s
applications_index  • [   0% ] waiting  09.0s
identity_me         • [   0% ] waiting  0m44.0s

running (0m27.0s), 10/20 VUs, 481 complete and 0 interrupted iterations
memberships_listing   [  90% ] 10 VUs   27.0s/30s
applications_index  • [   0% ] waiting  08.0s
identity_me         • [   0% ] waiting  0m43.0s

running (0m28.0s), 10/20 VUs, 498 complete and 0 interrupted iterations
memberships_listing   [  93% ] 10 VUs   28.0s/30s
applications_index  • [   0% ] waiting  07.0s
identity_me         • [   0% ] waiting  0m42.0s

running (0m29.0s), 10/20 VUs, 517 complete and 0 interrupted iterations
memberships_listing   [  97% ] 10 VUs   29.0s/30s
applications_index  • [   0% ] waiting  06.0s
identity_me         • [   0% ] waiting  0m41.0s

running (0m30.0s), 10/20 VUs, 534 complete and 0 interrupted iterations
memberships_listing   [ 100% ] 10 VUs   30.0s/30s
applications_index  • [   0% ] waiting  05.0s
identity_me         • [   0% ] waiting  0m40.0s

running (0m31.0s), 00/20 VUs, 544 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  • [   0% ] waiting  04.0s
identity_me         • [   0% ] waiting  0m39.0s

running (0m32.0s), 00/20 VUs, 544 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  • [   0% ] waiting  03.0s
identity_me         • [   0% ] waiting  0m38.0s

running (0m33.0s), 00/20 VUs, 544 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  • [   0% ] waiting  02.0s
identity_me         • [   0% ] waiting  0m37.0s

running (0m34.0s), 00/20 VUs, 544 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  • [   0% ] waiting  01.0s
identity_me         • [   0% ] waiting  0m36.0s

running (0m35.0s), 00/20 VUs, 544 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  • [   0% ] waiting  00.0s
identity_me         • [   0% ] waiting  0m35.0s

running (0m36.0s), 10/20 VUs, 554 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [   3% ] 10 VUs   01.0s/30s
identity_me         • [   0% ] waiting  0m34.0s

running (0m37.0s), 10/20 VUs, 583 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [   7% ] 10 VUs   02.0s/30s
identity_me         • [   0% ] waiting  0m33.0s

running (0m38.0s), 10/20 VUs, 603 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  10% ] 10 VUs   03.0s/30s
identity_me         • [   0% ] waiting  0m32.0s

running (0m39.0s), 10/20 VUs, 623 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  13% ] 10 VUs   04.0s/30s
identity_me         • [   0% ] waiting  0m31.0s

running (0m40.0s), 10/20 VUs, 650 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  17% ] 10 VUs   05.0s/30s
identity_me         • [   0% ] waiting  0m30.0s

running (0m41.0s), 10/20 VUs, 672 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  20% ] 10 VUs   06.0s/30s
identity_me         • [   0% ] waiting  0m29.0s

running (0m42.0s), 10/20 VUs, 693 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  23% ] 10 VUs   07.0s/30s
identity_me         • [   0% ] waiting  0m28.0s

running (0m43.0s), 10/20 VUs, 719 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  27% ] 10 VUs   08.0s/30s
identity_me         • [   0% ] waiting  0m27.0s

running (0m44.0s), 10/20 VUs, 741 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  30% ] 10 VUs   09.0s/30s
identity_me         • [   0% ] waiting  0m26.0s

running (0m45.0s), 10/20 VUs, 761 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  33% ] 10 VUs   10.0s/30s
identity_me         • [   0% ] waiting  0m25.0s

running (0m46.0s), 10/20 VUs, 786 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  37% ] 10 VUs   11.0s/30s
identity_me         • [   0% ] waiting  0m24.0s

running (0m47.0s), 10/20 VUs, 808 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  40% ] 10 VUs   12.0s/30s
identity_me         • [   0% ] waiting  0m23.0s

running (0m48.0s), 10/20 VUs, 833 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  43% ] 10 VUs   13.0s/30s
identity_me         • [   0% ] waiting  0m22.0s

running (0m49.0s), 10/20 VUs, 858 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  47% ] 10 VUs   14.0s/30s
identity_me         • [   0% ] waiting  0m21.0s

running (0m50.0s), 10/20 VUs, 880 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  50% ] 10 VUs   15.0s/30s
identity_me         • [   0% ] waiting  0m20.0s

running (0m51.0s), 10/20 VUs, 905 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  53% ] 10 VUs   16.0s/30s
identity_me         • [   0% ] waiting  0m19.0s

running (0m52.0s), 10/20 VUs, 928 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  57% ] 10 VUs   17.0s/30s
identity_me         • [   0% ] waiting  0m18.0s

running (0m53.0s), 10/20 VUs, 953 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  60% ] 10 VUs   18.0s/30s
identity_me         • [   0% ] waiting  0m17.0s

running (0m54.0s), 10/20 VUs, 977 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  63% ] 10 VUs   19.0s/30s
identity_me         • [   0% ] waiting  0m16.0s

running (0m55.0s), 10/20 VUs, 1002 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  67% ] 10 VUs   20.0s/30s
identity_me         • [   0% ] waiting  0m15.0s

running (0m56.0s), 10/20 VUs, 1026 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  70% ] 10 VUs   21.0s/30s
identity_me         • [   0% ] waiting  0m14.0s

running (0m57.0s), 10/20 VUs, 1046 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  73% ] 10 VUs   22.0s/30s
identity_me         • [   0% ] waiting  0m13.0s

running (0m58.0s), 10/20 VUs, 1076 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  77% ] 10 VUs   23.0s/30s
identity_me         • [   0% ] waiting  0m12.0s

running (0m59.0s), 10/20 VUs, 1096 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  80% ] 10 VUs   24.0s/30s
identity_me         • [   0% ] waiting  0m11.0s

running (1m00.0s), 10/20 VUs, 1116 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  83% ] 10 VUs   25.0s/30s
identity_me         • [   0% ] waiting  0m10.0s

running (1m01.0s), 10/20 VUs, 1141 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  87% ] 10 VUs   26.0s/30s
identity_me         • [   0% ] waiting  0m09.0s

running (1m02.0s), 10/20 VUs, 1165 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  90% ] 10 VUs   27.0s/30s
identity_me         • [   0% ] waiting  0m08.0s

running (1m03.0s), 10/20 VUs, 1185 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  93% ] 10 VUs   28.0s/30s
identity_me         • [   0% ] waiting  0m07.0s

running (1m04.0s), 10/20 VUs, 1213 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [  97% ] 10 VUs   29.0s/30s
identity_me         • [   0% ] waiting  0m06.0s

running (1m05.0s), 10/20 VUs, 1233 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index    [ 100% ] 10 VUs   30.0s/30s
identity_me         • [   0% ] waiting  0m05.0s

running (1m06.0s), 00/20 VUs, 1243 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  ✓ [ 100% ] 10 VUs   30s
identity_me         • [   0% ] waiting  0m04.0s

running (1m07.0s), 00/20 VUs, 1243 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  ✓ [ 100% ] 10 VUs   30s
identity_me         • [   0% ] waiting  0m03.0s

running (1m08.0s), 00/20 VUs, 1243 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  ✓ [ 100% ] 10 VUs   30s
identity_me         • [   0% ] waiting  0m02.0s

running (1m09.0s), 00/20 VUs, 1243 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  ✓ [ 100% ] 10 VUs   30s
identity_me         • [   0% ] waiting  0m01.0s

running (1m10.0s), 00/20 VUs, 1243 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs   30s
applications_index  ✓ [ 100% ] 10 VUs   30s
identity_me         • [   0% ] waiting  0m00.0s

running (1m11.0s), 10/20 VUs, 1261 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [   3% ] 10 VUs  01.0s/30s

running (1m12.0s), 10/20 VUs, 1282 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [   7% ] 10 VUs  02.0s/30s

running (1m13.0s), 10/20 VUs, 1306 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  10% ] 10 VUs  03.0s/30s

running (1m14.0s), 10/20 VUs, 1333 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  13% ] 10 VUs  04.0s/30s

running (1m15.0s), 10/20 VUs, 1353 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  17% ] 10 VUs  05.0s/30s

running (1m16.0s), 10/20 VUs, 1381 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  20% ] 10 VUs  06.0s/30s

running (1m17.0s), 10/20 VUs, 1401 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  23% ] 10 VUs  07.0s/30s

running (1m18.0s), 10/20 VUs, 1429 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  27% ] 10 VUs  08.0s/30s

running (1m19.0s), 10/20 VUs, 1454 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  30% ] 10 VUs  09.0s/30s

running (1m20.0s), 10/20 VUs, 1479 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  33% ] 10 VUs  10.0s/30s

running (1m21.0s), 10/20 VUs, 1503 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  37% ] 10 VUs  11.0s/30s

running (1m22.0s), 10/20 VUs, 1532 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  40% ] 10 VUs  12.0s/30s

running (1m23.0s), 10/20 VUs, 1557 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  43% ] 10 VUs  13.0s/30s

running (1m24.0s), 10/20 VUs, 1583 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  47% ] 10 VUs  14.0s/30s

running (1m25.0s), 10/20 VUs, 1608 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  50% ] 10 VUs  15.0s/30s

running (1m26.0s), 10/20 VUs, 1630 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  53% ] 10 VUs  16.0s/30s

running (1m27.0s), 10/20 VUs, 1655 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  57% ] 10 VUs  17.0s/30s

running (1m28.0s), 10/20 VUs, 1683 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  60% ] 10 VUs  18.0s/30s

running (1m29.0s), 10/20 VUs, 1706 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  63% ] 10 VUs  19.0s/30s

running (1m30.0s), 10/20 VUs, 1729 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  67% ] 10 VUs  20.0s/30s

running (1m31.0s), 10/20 VUs, 1750 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  70% ] 10 VUs  21.0s/30s

running (1m32.0s), 10/20 VUs, 1778 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  73% ] 10 VUs  22.0s/30s

running (1m33.0s), 10/20 VUs, 1798 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  77% ] 10 VUs  23.0s/30s

running (1m34.0s), 10/20 VUs, 1825 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  80% ] 10 VUs  24.0s/30s

running (1m35.0s), 10/20 VUs, 1849 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  83% ] 10 VUs  25.0s/30s

running (1m36.0s), 10/20 VUs, 1876 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  87% ] 10 VUs  26.0s/30s

running (1m37.0s), 10/20 VUs, 1900 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  90% ] 10 VUs  27.0s/30s

running (1m38.0s), 10/20 VUs, 1920 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  93% ] 10 VUs  28.0s/30s

running (1m39.0s), 10/20 VUs, 1948 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [  97% ] 10 VUs  29.0s/30s

running (1m40.0s), 10/20 VUs, 1968 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me           [ 100% ] 10 VUs  30.0s/30s
     ✓ memberships 200
     ✓ applications 200
     ✓ me 200

     checks...............................: 100.00% ✓ 1978      ✗ 0   
     data_received........................: 43 MB   429 kB/s
     data_sent............................: 1.6 MB  16 kB/s
     http_req_blocked.....................: avg=12.74µs  min=1.38µs   med=4.65µs   p(90)=6.57µs   p(95)=7.73µs   max=1.28ms  
     http_req_connecting..................: avg=4.04µs   min=0s       med=0s       p(90)=0s       p(95)=0s       max=773.2µs 
     http_req_duration....................: avg=257.43ms min=134.2ms  med=231.83ms p(90)=373.92ms p(95)=411.03ms max=609.43ms
       { expected_response:true }.........: avg=257.43ms min=134.2ms  med=231.83ms p(90)=373.92ms p(95)=411.03ms max=609.43ms
     ✓ { scenario:applications_index }....: avg=231.72ms min=160.01ms med=214.79ms p(90)=308.48ms p(95)=369.96ms max=432.93ms
     ✓ { scenario:identity_me }...........: avg=210.48ms min=134.2ms  med=195.46ms p(90)=279.85ms p(95)=328.03ms max=432.72ms
     ✓ { scenario:memberships_listing }...: avg=353.89ms min=268.14ms med=340.09ms p(90)=433.65ms p(95)=482.44ms max=609.43ms
     http_req_failed......................: 0.00%   ✓ 0         ✗ 1978
     ✓ { scenario:applications_index }....: 0.00%   ✓ 0         ✗ 699 
     ✓ { scenario:identity_me }...........: 0.00%   ✓ 0         ✗ 735 
     ✓ { scenario:memberships_listing }...: 0.00%   ✓ 0         ✗ 544 
     http_req_receiving...................: avg=174.28µs min=16.48µs  med=105.94µs p(90)=371.91µs p(95)=432.21µs max=3.37ms  
     http_req_sending.....................: avg=20.16µs  min=5.31µs   med=15.59µs  p(90)=35.65µs  p(95)=40.7µs   max=401.39µs
     http_req_tls_handshaking.............: avg=0s       min=0s       med=0s       p(90)=0s       p(95)=0s       max=0s      
     http_req_waiting.....................: avg=257.23ms min=134.14ms med=231.7ms  p(90)=373.73ms p(95)=410.6ms  max=608.57ms
     http_reqs............................: 1978    19.726093/s
     ✓ { scenario:applications_index }....: 699     6.97095/s
     ✓ { scenario:identity_me }...........: 735     7.329969/s
     ✓ { scenario:memberships_listing }...: 544     5.425174/s
     iteration_duration...................: avg=458.18ms min=334.75ms med=432.78ms p(90)=574.97ms p(95)=612.25ms max=810.72ms
     iterations...........................: 1978    19.726093/s
     vus..................................: 10      min=0       max=10
     vus_max..............................: 20      min=20      max=20
running (1m40.3s), 00/20 VUs, 1978 complete and 0 interrupted iterations
memberships_listing ✓ [ 100% ] 10 VUs  30s
applications_index  ✓ [ 100% ] 10 VUs  30s
identity_me         ✓ [ 100% ] 10 VUs  30s